#использовать TMSSQL

УправлениеMSSQL = Новый УправлениеMSSQL();

ПараметрыПодключения = УправлениеMSSQL.ПараметрыПодключения;
ПараметрыПодключения.АдресСервераSQL = "localhost";
ПараметрыПодключения.ИмяПользователяSQL = "sa";
ПараметрыПодключения.ПарольПользователяSQL = "Tele217091";
ПараметрыПодключения.ИмяБазыДанныхSQL = "industrial_design_standards";


ТЗ = УправлениеMSSQL.ПолучитьСтруктуруФайловБД();

Для каждого стр ИЗ ТЗ Цикл
	Сообщить(стр.ЛогическоеИмя);
КонецЦикла;

РезультатРезервогоКопирования = УправлениеMSSQL.СделатьРезервнуюКопиюБД("D:\4. REPLICA",ПараметрыПодключения.ИмяБазыДанныхSQL+".bak",1,1,1);
Сообщить(РезультатРезервогоКопирования);

РезультатВосстановления =  УправлениеMSSQL.ВосстановитьИзРезервнойКопииБД("D:\4. REPLICA\"+ПараметрыПодключения.ИмяБазыДанныхSQL+".bak",ТЗ);
Сообщить(РезультатВосстановления);


РезультатИзмененияМоделиВоостановления =  УправлениеMSSQL.ИзменитьМодельВосстановленияБД();
Сообщить(РезультатИзмененияМоделиВоостановления);

РезультатСжатьБД =  УправлениеMSSQL.СжатьБД(0,1);
Сообщить(РезультатСжатьБД);

РезультатСжатьФайлыБД =  УправлениеMSSQL.СжатьФайлыБД(0,10,1);
Сообщить(РезультатСжатьФайлыБД);

РезультатСжатьФайлыБД =  УправлениеMSSQL.СжатьФайлыБД(1,10,1);
Сообщить(РезультатСжатьФайлыБД);